//*************************************************************
Процедура ОбновленияИндексаПолнотекстовогоПоиска() Экспорт
	
	Если Не ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска()
		= РежимПолнотекстовогоПоиска.Разрешить Тогда
		Если Не ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

//*************************************************************
Функция ПолучитьПараметрСеанса(ПараметрСеанса) Экспорт
	
	Попытка
		Возврат ПараметрыСеанса[ПараметрСеанса];
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

//*************************************************************
Процедура УстановитьПараметрСеанса(ПараметрСеанса,Значение) Экспорт
	
	Попытка
		ПараметрыСеанса[ПараметрСеанса]=Значение;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

//*************************************************************
Функция ПолучитьКонстанту(Константа) Экспорт
	
	Попытка
		Возврат Константы[Константа].Получить();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

//*************************************************************
Процедура УстановитьКонстанту(ПараметрСеанса,Значение) Экспорт
	
	Попытка
		Константы[ПараметрСеанса].Установить(Значение);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

