
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Группа2.Видимость = Константы.ТС_ИспользоватьИзбранныеТесты.Получить();
	
КонецПроцедуры

 #КонецОбласти

#Область ДействияФормы

&НаКлиенте
Процедура НеВыделятьОтмеченныеТестыПриИзменении(Элемент)
	
	Объект.НеВыделятьОтмеченныеТестыТолькоДляВебКлиента = Объект.НеВыделятьОтмеченныеТесты;
		
КонецПроцедуры

&НаКлиенте
Процедура ОткрыватьФормуТестированияВНовомОкнеПриИзменении(Элемент)
	
	Объект.ОткрыватьФормуТестированияВНовомОкнеТолькоДляВебКлиента = Объект.ОткрыватьФормуТестированияВНовомОкне;
	
КонецПроцедуры

&НаКлиенте
Процедура ШиринаФормыТестированияПриИзменении(Элемент)
	
	Объект.ШиринаФормыТестированияТолькоДляВебКлиента = ?(Объект.ШиринаФормыТестирования=0,Ложь,Истина);
	
КонецПроцедуры

#КонецОбласти