//*************************************************************
&НаКлиенте
Процедура ТС_ИспользоватьПрограммыОбученияПриИзменении(Элемент)
	
	Если НаборКонстант.ТС_ИспользоватьПрограммыОбучения И
		НЕ НаборКонстант.ТС_ИспользоватьНаборыТестов Тогда
		НаборКонстант.ТС_ИспользоватьНаборыТестов = Истина;
	КонецЕсли;
	
КонецПроцедуры

//*************************************************************
&НаКлиенте
Процедура ТС_ИспользоватьНаборыТестовПриИзменении(Элемент)
	
	Если НЕ НаборКонстант.ТС_ИспользоватьНаборыТестов И
		НаборКонстант.ТС_ИспользоватьПрограммыОбучения Тогда
		НаборКонстант.ТС_ИспользоватьПрограммыОбучения = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

