//*************************************************************
Функция ЗаполнитьПодтвержденияТестов(ТекДокумент) Экспорт
	
	ТекКомментарий = ТекДокумент.ТС_Комментарий;
	ОбработаноЭлементов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТС_РезультатТестированияТесты.Тест
	|ПОМЕСТИТЬ ВТТестыИзДокумента
	|ИЗ
	|	Документ.ТС_РезультатТестирования.Тесты КАК ТС_РезультатТестированияТесты
	|ГДЕ
	|	ТС_РезультатТестированияТесты.Ссылка = &Ссылка
	|	И ТС_РезультатТестированияТесты.Правильный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТестыИзДокумента.Тест
	|ИЗ
	|	ВТТестыИзДокумента КАК ТестыИзДокумента
	|ГДЕ
	|	НЕ ТестыИзДокумента.Тест В
	|			(ВЫБРАТЬ
	|				ТестыИзДокумента.Тест
	|			ИЗ
	|				ВТТестыИзДокумента КАК ТестыИзДокумента
	|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТС_Тесты.Подтверждение КАК ТС_ТестыПодтверждение
	|					ПО
	|						ТестыИзДокумента.Тест = ТС_ТестыПодтверждение.Ссылка
	|							И &Ссылка = ТС_ТестыПодтверждение.СсылкаПодтверждение)";
	
	Запрос.УстановитьПараметр("Ссылка", ТекДокумент);	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекТест = ВыборкаДетальныеЗаписи.Тест.ПолучитьОбъект();
		СтрокаПодтверждения = ТекТест.Подтверждение.Добавить();
		СтрокаПодтверждения.Описание = ТекКомментарий;
		СтрокаПодтверждения.СсылкаПодтверждение = ТекДокумент;
		Попытка
			 ТекТест.Записать();
			 ОбработаноЭлементов = ОбработаноЭлементов + 1;
		Исключение
			 Сообщить(ОписаниеОшибки());
		КонецПопытки;	 
		
	КонецЦикла;
	
	Возврат ОбработаноЭлементов;
	
КонецФункции

//**************************************************************
Функция ПостроитьСтрокуПравильныхОтветов(ТекТест)
	
	СтрокаОтвет = "";
	Для Каждого Строка ИЗ ТекТест.Ответы Цикл
		Если Строка.Правильный Тогда 
			СтрокаОтвет = ?(СтрДлина(СтрокаОтвет)=0,"",СтрокаОтвет + ", ") + Строка(Строка.НомерСтроки);
		КонецЕсли;
	КонецЦикла;
	Возврат СтрокаОтвет;
	
КонецФункции

//**************************************************************
Функция УстановитьСтатусИПодтверждения(ТекДокумент) Экспорт
	
	ТекОбъект = ТекДокумент.ПолучитьОбъект();
	
	Для Каждого Строка ИЗ ТекОбъект.Тесты Цикл
		СтрокаПравильных = ПостроитьСтрокуПравильныхОтветов(Строка.Тест);
		Если СтрокаПравильных = Строка.Ответ Тогда
			Строка.Правильный = Истина;
		Иначе
			Строка.Правильный = Ложь;
		КонецЕсли;
	КонецЦикла;	
	
	Попытка
		ТекОбъект.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Если НЕ ЗаполнитьПодтвержденияТестов(ТекДокумент) ТОгда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;	
	
КонецФункции